{"Book_Id":"2014002025","Book_Info":" 这是博客里的第一篇文章。主要是介绍一下我从Java零基础到工作四个月之间这一段事情。后面会陆续写一些工作之中用到的一些东西和记录一些自己学习相关技术的文章。目的是为能够跟别人一起多交流分享学习经验，共同提高能力。如果能帮到一两个人，或者能交到一两好友，那也是极好的事情了。\r\n先来说一下博主的经历，16年7月从某不发达省区不知名本科毕业。本科学的是电子科学与技术专业，关于编程也就大一下的时候学过一学期的C语言课程。当时第一次接触这种计算机语言，是被各种算法啊，指针啊，弄得头大。还记得当年老师最喜欢出的题目就是‘求100以内的所有素数和’、‘求某一年是平年还是闰年'啦，‘n=5; print(++n+n++)是多少’，‘汉诺比塔一次只能移动一颗石头，移完就世界末日了，那世界末日还有多久啊？’之类的题目，我相信课堂上老师沉醉在编程世界的表情和我们的表情是这样的。简直转来转去搞得人不能自理。也不知道敲这些有什么实际用处，老师也不会讲书本外如何具体应用的事情，所以一直兴趣寥寥，最后勉强低分通过。当时就想自己以后应该不会从事编程相关的工作吧，好像不是那块料。然后嘻嘻哈哈开开黑吹吹牛就睡到了大四，然后某天中午起床穿个拖鞋松松垮垮去打饭时，蓦然发现班上女生一群女孩子已经严阵以待开始正装打扮准备去听宣讲会准备面试之类的了。跟她们一照面，互相瞅了瞅，还是挺尴尬的，还好大学几年脸皮练得够厚，平时跟她们接触也比较多，虽然知道不会有什么大公司会来这种小学校招人，但还是腆着脸上去问了些招聘公司的情况和最近有哪些招聘的公司。 等吃完饭回到宿舍，额...舍友有的还没起床，跟他们一说女生已经去宣讲会的事情，个个都带着惊奇,'啊，宣讲会？什么宣讲会？'...  我只能承认在召唤师峡谷时，他们是一群可靠的队友。但是在生活中，估计只能集体团灭ACE了。 后面的事情就不多说了，装模作样听了几个宣讲会，发现专业对口的都是搞硬件的多，像什么PCB画图啊，电路板设计啊之类的，都不是很喜欢，逐渐宣讲会都懒得去听了。 我觉得我这人有一个优点，那就是很相信凭我的能力，在社会上混口饭吃并不成问题。 至于温饱之后要做的事情，我也不是很清楚，到时侯再说呗。 然后又继续玩到了大四下学期。\r\n嗦嗦了一大堆，还没说到JAVA，看官莫急。也就是在大四开学不久的时候，跟一个已经毕业了两年的老学长聊天时，说到毕业后不知道干嘛的问题。这学长是我一个老乡，平时也玩得不错。他跟我说:\" 嗨，别搞硬件那些了，那个没前途的，做硬件干几年都没什么前途。我现在都改做软件了，现在很多软件公司，钱多人傻，刚毕业的都有七八千的工资，学得乓坏悖分分钟几十万上百万年薪。你小子趁早入行，早入行早致富啊！\"   我一听，正中下怀啊，干什么不是干，干嘛不选个钱多的工作。就因为这句话，我决定要改学软件啦。老乡给我的建议是先学点JAVA，学得差不多了就转学Andriod，他说Andriod的市场未来还会更大！ \r\n这便是我入行的经过啦。听完话后的第二天，我马上买了系列入门书籍来看。如《JAVA 从入门到精通》。从3月分开始，到7月份毕业。毕业后两周在深圳一家软件公司上班。工资嘛，虽然才六七k，但这没关系，先安心做着，实际练练手(目前工作内容用到的基础知识重点在集合、IO流、用正则表达式匹配数据等，因为项目也在用到一个大数据的框架，所以也在根据需要学习一些大数据相关的东西)，反正边工作边学习，真正有技术的人是不愁拿不到高薪的。 也是在临近毕业的四个月的时间，我把这本书重要的东西看了一遍。现在想一想，这本书也不算很好。讲得太详细了，以至于不好抓住重点。如果你也是零基础，想从事JAVA开发这份工作，按照我的意见，这本数看到十八章就行，也就是看到多线程这一章就足以。 后面的内容其实已经过时了。等看完了这十八章，对JAVA基础有了一定的基础之后，就可以看JSP的知识，也就是JAVA跟web前台页面联合起来用。JSP需要一点html网页的基础，这个可以在许多网站上看视频学（推荐慕课网），照着操作，两天就能学会。在学JSP的时候，你会接触到一个叫 JavaScript 俗称js的东西。这个也不难，照着网站学一下就行（推荐慕课网）。同样，在学JSP的时候，你会听说一个概念叫：MVC分层，其实这东西很简单，M--Model就是JavaBean也就是一种符合一定规范的Java类，V--View就是视图也就是前台显示的东西，C--Controller就是控制器也就是Servlet之类是通过写一些方法来沟通Model与View之间的交互；JSP相关知识掌握好后，那可以看一下框架相关的东西，SSH、SSM框架是现在用得比较多的框架，如果只想找工作而已的话，知道这些框架的流程就行，新手面试其实也就是以基础知识来面得多，因为工作中如果是大公司的话框架是有专门的架构师来搭的。如果你对框架的搭建过程和作用有一些了解后，想找一份工作，那就做好一份简历，并在网上找一些面试题来背吧。 如果你是新手去面试，只要把JAVA相关常问的概念都弄清楚了，能用自己的话说出来就行，重要的还是要有自信。(这是我的面试经验)"}